#第一个代码：g取（0,2）上的均匀分布
u=rep(0,1000)
v=rep(0,1000)
x=rep(0,1000)
e=rep(0,1000)
f=rep(0,1000)#生成一些长度为1000的0序列备用赋值
x0=seq(0,2,length=1000)#将(0,2)区间分成1000段
f0=rep(0,1000)#目标概率密度函数的值域空间（暂未赋值）
for(j in 1:1000)#生成目标概率密度函数
{
  if(x0[j]<=0.5)
  {
    f0[j]<-4*x0[j]/3
  }
  else if(0.5<x0[j]&x0[j]<=1)
  {
    f0[j]<-4/3-4*x0[j]/3
  }
  else if(1<x0[j]&x0[j]<=1.5)
  {
    f0[j]<-8*x0[j]/3-8/3
  }
  else
  {
    f0[j]<-16/3-8*x0[j]/3
  }
}

m=8/3#（舍选法原理中的M）
i= 1
while(i<=1000)#舍选法生成1000组目标随机变量X
{
  u[i]<-runif(1,0,1);
  v[i]<-runif(1,0,2);
  if(v[i]<=0.5)
  {
    f[i]<-4*v[i]/3
  }
  else if(0.5<v[i]&v[i]<=1)
  {
    f[i]<-4/3-4*v[i]/3
  }
  else if(1<v[i]&v[i]<=1.5)
  {
    f[i]<-8*v[i]/3-8/3
  }
  else
  {
    f[i]<-16/3-8*v[i]/3
  }
  if(u[i]*m*1/2<f[i])
  {
    x[i]<-v[i]
    i<-i+1
  }
  e[i]<-e[i]+1
}
S=0
for(i in 1:1000)
{
  S<-S+e[i]
}
S=S/1000#生成一个随机样本X平均需要的计算次数
hist(x,50,prob='TRUE',main='M=8/3')
lines(x0,f0)


#第二个代码：g取（0,1）上1/3，（1,2）上2/3
u=rep(0,1000)
v=rep(0,1000)
x=rep(0,1000)
e=rep(0,1000)
f=rep(0,1000)#生成一些长度为1000的0序列备用赋值
x0=seq(0,2,length=1000)#将(0,2)区间分成1000段
f0=rep(0,1000)#目标概率密度函数的值域空间（暂未赋值）
for(j in 1:1000)#生成目标概率密度函数
{
  if(x0[j]<=0.5)
  {
    f0[j]<-4*x0[j]/3
  }
  else if(0.5<x0[j]&x0[j]<=1)
  {
    f0[j]<-4/3-4*x0[j]/3
  }
  else if(1<x0[j]&x0[j]<=1.5)
  {
    f0[j]<-8*x0[j]/3-8/3
  }
  else
  {
    f0[j]<-16/3-8*x0[j]/3
  }
}

m=2#（舍选法原理中的M）
i= 1
g=rep(0,1000)
while(i<=1000)#舍选法生成1000组目标随机变量X
{
  u[i]<-runif(1,0,1);
  v[i]<-runif(1,0,2);
  if(v[i]<=0.5)
  {
    f[i]<-4*v[i]/3
    g[i]<-1/3
  }
  else if(0.5<v[i]&v[i]<=1)
  {
    f[i]<-4/3-4*v[i]/3
    g[i]<-1/3
  }
  else if(1<v[i]&v[i]<=1.5)
  {
    f[i]<-8*v[i]/3-8/3
    g[i]<-2/3
  }
  else
  {
    f[i]<-16/3-8*v[i]/3
    g[i]<-2/3
  }
  if(u[i]*m*g[i]<f[i])
  {
    x[i]<-v[i]
    i<-i+1
  }
  e[i]<-e[i]+1
}
S=0
for(i in 1:1000)
{
  S<-S+e[i]
}
S=S/1000#生成一个随机样本X平均需要的计算次数
hist(x,50,prob='TRUE')
lines(x0,f0)


#第三个代码：g取（0,1）上1/4，（1,2）上3/4
u=rep(0,1000)
v=rep(0,1000)
x=rep(0,1000)
e=rep(0,1000)
f=rep(0,1000)#生成一些长度为1000的0序列备用赋值
x0=seq(0,2,length=1000)#将(0,2)区间分成1000段
f0=rep(0,1000)#目标概率密度函数的值域空间（暂未赋值）
for(j in 1:1000)#生成目标概率密度函数
{
  if(x0[j]<=0.5)
  {
    f0[j]<-4*x0[j]/3
  }
  else if(0.5<x0[j]&x0[j]<=1)
  {
    f0[j]<-4/3-4*x0[j]/3
  }
  else if(1<x0[j]&x0[j]<=1.5)
  {
    f0[j]<-8*x0[j]/3-8/3
  }
  else
  {
    f0[j]<-16/3-8*x0[j]/3
  }
}

m=8/3#（舍选法原理中的M）
i= 1
g=rep(0,1000)
while(i<=1000)#舍选法生成1000组目标随机变量X
{
  u[i]<-runif(1,0,1);
  v[i]<-runif(1,0,2);
  if(v[i]<=0.5)
  {
    f[i]<-4*v[i]/3
    g[i]<-1/4
  }
  else if(0.5<v[i]&v[i]<=1)
  {
    f[i]<-4/3-4*v[i]/3
    g[i]<-1/4
  }
  else if(1<v[i]&v[i]<=1.5)
  {
    f[i]<-8*v[i]/3-8/3
    g[i]<-3/4
  }
  else
  {
    f[i]<-16/3-8*v[i]/3
    g[i]<-3/4
  }
  if(u[i]*m*g[i]<f[i])
  {
    x[i]<-v[i]
    i<-i+1
  }
  e[i]<-e[i]+1
}
S=0
for(i in 1:1000)
{
  S<-S+e[i]
}
S=S/1000#生成一个随机样本X平均需要的计算次数
hist(x,50,prob='TRUE')
lines(x0,f0)



